
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.Сотрудники.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Код,
	|	Сотрудники.Наименование,
	|	Сотрудники.ТрудоваяДеятельность.(
	|		НомерСтроки,
	|		Организация,
	|		НачалоРаботы,
	|		ОкончаниеРаботы,
	|		Должность
	|	)
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТрудоваяДеятельностьШапка = Макет.ПолучитьОбласть("ТрудоваяДеятельностьШапка");
	ОбластьТрудоваяДеятельность = Макет.ПолучитьОбласть("ТрудоваяДеятельность");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТрудоваяДеятельностьШапка);
		ВыборкаТрудоваяДеятельность = Выборка.ТрудоваяДеятельность.Выбрать();
		Пока ВыборкаТрудоваяДеятельность.Следующий() Цикл
			ОбластьТрудоваяДеятельность.Параметры.Заполнить(ВыборкаТрудоваяДеятельность);
			ТабДок.Вывести(ОбластьТрудоваяДеятельность, ВыборкаТрудоваяДеятельность.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
